podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/IOCON_LPC11Cxx.svd.xml
            <register>
               <name>PIO0_9</name>
               <description>I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1</description>
               <addressOffset>0x64</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO0_9</name>
                           <description>Selects function PIO0_9</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI0</name>
                           <description>Selects function MOSI0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16B0_MAT1</name>
                           <description>Selects function CT16B0_MAT1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWCLK_PIO0_10</name>
               <description>I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2</description>
               <addressOffset>0x68</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SWCLK</name>
                           <description>Selects function SWCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO0_10</name>
                           <description>Selects function PIO0_10</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK0</name>
                           <description>Selects function SCK0 (only if pin SWCLK/PIO0_10/SCK0/CT16B0_MAT2 selected in Table 147)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16B0_MAT2</name>
                           <description>Selects function CT16B0_MAT2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIO1_10</name>
               <description>I/O configuration for pin PIO1_10/AD6/CT16B1_MAT1/ MISO1</description>
               <addressOffset>0x6C</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SPIO1_10</name>
                           <description>Selects function PIO1_10</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AD6</name>
                           <description>Selects function AD6</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16B1_MAT</name>
                           <description>Selects function CT16B1_MAT1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMODE</name>
                     <description>Selects Analog/Digital mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ANALOG_INPUT_MODE</name>
                           <description>Analog input mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIGITAL_FUNCTIONAL_M</name>
                           <description>Digital functional mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIO2_11</name>
               <description>I/O configuration for pin PIO2_11/SCK0/ CT32B0_CAP1</description>
               <addressOffset>0x70</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO2_11</name>
                           <description>Selects function PIO2_11</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK0</name>
                           <description>Select function SCK0 (only if pin PIO2_11/SCK0 selected in  Table 147)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
