podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/IOCON_LPC11Cxx.svd.xml
            <register>
               <name>PIO3_0</name>
               <description>I/O configuration for pin PIO3_0/DTR/CT16B0_MAT0/TXD</description>
               <addressOffset>0x84</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO3_0</name>
                           <description>Selects function PIO3_0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DTR</name>
                           <description>Selects function DTR</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIO3_1</name>
               <description>I/O configuration for pin PIO3_1/DSR/CT16B0_MAT1/RXD</description>
               <addressOffset>0x88</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO3_1</name>
                           <description>Selects function PIO3_1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSR</name>
                           <description>Selects function DSR</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIO2_3</name>
               <description>I/O configuration for pin PIO2_3/RI/MOSI1</description>
               <addressOffset>0x8C</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO2_3</name>
                           <description>Selects function PIO2_3</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RI</name>
                           <description>Selects function RI</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI1</name>
                           <description>Selects function MOSI1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWDIO_PIO1_3</name>
               <description>I/O configuration for pin SWDIO/PIO1_3/AD4/CT32B1_MAT2</description>
               <addressOffset>0x90</addressOffset>
               <resetValue>0xD0</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. All other values are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SWDIO</name>
                           <description>Selects function SWDIO</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO1_3</name>
                           <description>Selects function PIO1_3</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AD4</name>
                           <description>Selects function AD4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT32B1_MAT2</name>
                           <description>Selects function CT32B1_MAT2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMODE</name>
                     <description>Selects Analog/Digital mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ANALOG_INPUT_MODE</name>
                           <description>Analog input mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIGITAL_FUNCTIONAL_M</name>
                           <description>Digital functional mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Selects pseudo open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STANDARD_GPIO_OUTPUT</name>
                           <description>Standard GPIO output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_OUTPUT</name>
                           <description>Open-drain output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
