podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/IOCON_LPC11Cxx.svd.xml
            <register>
               <name>MISO1_LOC</name>
               <description>MISO1 pin location select register</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>MISO1LOC</name>
                     <description>Selects pin location for the MISO1 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO2_2</name>
                           <description>Selects MISO1 function in pin location PIO2_2/DCD/MISO1 (see Table 126)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO1_10</name>
                           <description>Selects MISO1 function in pin location PIO1_10/AD6/CT16B1_MAT1/MISO1 (see  Table 130)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOSI1_LOC</name>
               <description>MOSI1 pin location select register</description>
               <addressOffset>0xCC</addressOffset>
               <fields>
                  <field>
                     <name>MOSI1LOC</name>
                     <description>Selects pin location for the MOSI1 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO2_3</name>
                           <description>Selects MOSI1 function in pin location PIO2_3/RI/MOSI1 (see Table 138)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO1_9</name>
                           <description>Selects MOSI1 function in pin location PIO1_9/CT16B1_MAT0/MOSI1 (see Table 117)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXD_LOC</name>
               <description>RXD pin location select register</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>RXDLOC</name>
                     <description>Selects pin location for the RXD function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO1_6</name>
                           <description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO2_7</name>
                           <description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO3_1</name>
                           <description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO3_4</name>
                           <description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
